#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
data.aws_ami.amazon_ami: Reading...
aws_eip.nat_gateway[0]: Refreshing state... [id=eipalloc-09dc8083c1dc1a862]
aws_eip.nat_gateway[1]: Refreshing state... [id=eipalloc-0f251dfad9fad1200]
aws_eip.nat_gateway[2]: Refreshing state... [id=eipalloc-084352f7ca2f67896]
aws_vpc.this: Refreshing state... [id=vpc-0d128a4188199ed21]
data.aws_ami.amazon_ami: Read complete after 1s [id=ami-07251f912d2a831a3]
aws_subnet.public[1]: Refreshing state... [id=subnet-01f78e365227fc3af]
aws_default_security_group.default: Refreshing state... [id=sg-0d7816357a2684017]
aws_subnet.public[2]: Refreshing state... [id=subnet-06c47914996e58f12]
aws_subnet.public[0]: Refreshing state... [id=subnet-0f010177d1621860f]
aws_subnet.private[0]: Refreshing state... [id=subnet-047639bebdac407d2]
aws_internet_gateway.this-igw: Refreshing state... [id=igw-07fd99c432b6386e2]
aws_subnet.private[1]: Refreshing state... [id=subnet-0f46f10f427ad6f19]
aws_route_table.private[1]: Refreshing state... [id=rtb-01ab94e509c91d7a7]
aws_route_table.public: Refreshing state... [id=rtb-0436180ca9751bfc9]
aws_subnet.private[2]: Refreshing state... [id=subnet-0f34564a0dcc1c76c]
aws_route_table.private[0]: Refreshing state... [id=rtb-0b47c8ab842de2030]
aws_route_table.private[2]: Refreshing state... [id=rtb-0f01b494bd773f472]
aws_nat_gateway.public[2]: Refreshing state... [id=nat-059563097a1d7eaf1]
aws_nat_gateway.public[1]: Refreshing state... [id=nat-0f12f13854256e79d]
aws_nat_gateway.public[0]: Refreshing state... [id=nat-071372bf2d3bd0659]
aws_route.internet-route: Refreshing state... [id=r-rtb-0436180ca9751bfc91080289494]
aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-052d3e1e6f93c9945]
aws_route_table_association.public[2]: Refreshing state... [id=rtbassoc-0fa0485badf7c70e1]
aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-07532927480fbeff2]
aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-0a29533f8285d48a8]
aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-0f2f84b8378507656]
aws_route_table_association.private[2]: Refreshing state... [id=rtbassoc-0704e08472938f326]
aws_route.private-route[1]: Refreshing state... [id=r-rtb-01ab94e509c91d7a71080289494]
aws_route.private-route[2]: Refreshing state... [id=r-rtb-0f01b494bd773f4721080289494]
aws_route.private-route[0]: Refreshing state... [id=r-rtb-0b47c8ab842de20301080289494]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_instance.app-server[0] will be created
  + resource "aws_instance" "app-server" {
      + ami                                  = "ami-07251f912d2a831a3"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = (known after apply)
      + availability_zone                    = (known after apply)
      + cpu_core_count                       = (known after apply)
      + cpu_threads_per_core                 = (known after apply)
      + disable_api_stop                     = (known after apply)
      + disable_api_termination              = (known after apply)
      + ebs_optimized                        = (known after apply)
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = (known after apply)
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_lifecycle                   = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t2.micro"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = (known after apply)
      + monitoring                           = (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + source_dest_check                    = true
      + spot_instance_request_id             = (known after apply)
      + subnet_id                            = "subnet-047639bebdac407d2"
      + tags                                 = {
          + "Name" = "app-server-1"
        }
      + tags_all                             = {
          + "Name"   = "app-server-1"
          + "Source" = "https://github.com/kunduso/add-aws-elb-ec2-private-subnet-terraform"
        }
      + tenancy                              = (known after apply)
      + user_data                            = "9ea6f797c2878361f94d9f508aad35b4b4039b50"
      + user_data_base64                     = (known after apply)
      + user_data_replace_on_change          = false
      + vpc_security_group_ids               = (known after apply)
    }

  # aws_instance.app-server[1] will be created
  + resource "aws_instance" "app-server" {
      + ami                                  = "ami-07251f912d2a831a3"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = (known after apply)
      + availability_zone                    = (known after apply)
      + cpu_core_count                       = (known after apply)
      + cpu_threads_per_core                 = (known after apply)
      + disable_api_stop                     = (known after apply)
      + disable_api_termination              = (known after apply)
      + ebs_optimized                        = (known after apply)
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = (known after apply)
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_lifecycle                   = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t2.micro"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = (known after apply)
      + monitoring                           = (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + source_dest_check                    = true
      + spot_instance_request_id             = (known after apply)
      + subnet_id                            = "subnet-0f46f10f427ad6f19"
      + tags                                 = {
          + "Name" = "app-server-2"
        }
      + tags_all                             = {
          + "Name"   = "app-server-2"
          + "Source" = "https://github.com/kunduso/add-aws-elb-ec2-private-subnet-terraform"
        }
      + tenancy                              = (known after apply)
      + user_data                            = "9ea6f797c2878361f94d9f508aad35b4b4039b50"
      + user_data_base64                     = (known after apply)
      + user_data_replace_on_change          = false
      + vpc_security_group_ids               = (known after apply)
    }

  # aws_instance.app-server[2] will be created
  + resource "aws_instance" "app-server" {
      + ami                                  = "ami-07251f912d2a831a3"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = (known after apply)
      + availability_zone                    = (known after apply)
      + cpu_core_count                       = (known after apply)
      + cpu_threads_per_core                 = (known after apply)
      + disable_api_stop                     = (known after apply)
      + disable_api_termination              = (known after apply)
      + ebs_optimized                        = (known after apply)
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = (known after apply)
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_lifecycle                   = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t2.micro"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = (known after apply)
      + monitoring                           = (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + source_dest_check                    = true
      + spot_instance_request_id             = (known after apply)
      + subnet_id                            = "subnet-0f34564a0dcc1c76c"
      + tags                                 = {
          + "Name" = "app-server-3"
        }
      + tags_all                             = {
          + "Name"   = "app-server-3"
          + "Source" = "https://github.com/kunduso/add-aws-elb-ec2-private-subnet-terraform"
        }
      + tenancy                              = (known after apply)
      + user_data                            = "9ea6f797c2878361f94d9f508aad35b4b4039b50"
      + user_data_base64                     = (known after apply)
      + user_data_replace_on_change          = false
      + vpc_security_group_ids               = (known after apply)
    }

  # aws_lb.front will be created
  + resource "aws_lb" "front" {
      + arn                                         = (known after apply)
      + arn_suffix                                  = (known after apply)
      + desync_mitigation_mode                      = "defensive"
      + dns_name                                    = (known after apply)
      + drop_invalid_header_fields                  = false
      + enable_deletion_protection                  = false
      + enable_http2                                = true
      + enable_tls_version_and_cipher_suite_headers = false
      + enable_waf_fail_open                        = false
      + enable_xff_client_port                      = false
      + id                                          = (known after apply)
      + idle_timeout                                = 60
      + internal                                    = false
      + ip_address_type                             = (known after apply)
      + load_balancer_type                          = "application"
      + name                                        = "front"
      + preserve_host_header                        = false
      + security_groups                             = (known after apply)
      + subnets                                     = [
          + "subnet-047639bebdac407d2",
          + "subnet-0f34564a0dcc1c76c",
          + "subnet-0f46f10f427ad6f19",
        ]
      + tags                                        = {
          + "Environment" = "front"
        }
      + tags_all                                    = {
          + "Environment" = "front"
          + "Source"      = "https://github.com/kunduso/add-aws-elb-ec2-private-subnet-terraform"
        }
      + vpc_id                                      = (known after apply)
      + xff_header_processing_mode                  = "append"
      + zone_id                                     = (known after apply)
    }

  # aws_lb_listener.front_end will be created
  + resource "aws_lb_listener" "front_end" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + load_balancer_arn = (known after apply)
      + port              = 80
      + protocol          = "HTTP"
      + ssl_policy        = (known after apply)
      + tags_all          = {
          + "Source" = "https://github.com/kunduso/add-aws-elb-ec2-private-subnet-terraform"
        }

      + default_action {
          + order            = (known after apply)
          + target_group_arn = (known after apply)
          + type             = "forward"
        }
    }

  # aws_lb_target_group.front will be created
  + resource "aws_lb_target_group" "front" {
      + arn                                = (known after apply)
      + arn_suffix                         = (known after apply)
      + connection_termination             = false
      + deregistration_delay               = "300"
      + id                                 = (known after apply)
      + ip_address_type                    = (known after apply)
      + lambda_multi_value_headers_enabled = false
      + load_balancing_algorithm_type      = (known after apply)
      + load_balancing_cross_zone_enabled  = (known after apply)
      + name                               = "application-front"
      + port                               = 80
      + preserve_client_ip                 = (known after apply)
      + protocol                           = "HTTP"
      + protocol_version                   = (known after apply)
      + proxy_protocol_v2                  = false
      + slow_start                         = 0
      + tags_all                           = {
          + "Source" = "https://github.com/kunduso/add-aws-elb-ec2-private-subnet-terraform"
        }
      + target_type                        = "instance"
      + vpc_id                             = "vpc-0d128a4188199ed21"

      + health_check {
          + enabled             = true
          + healthy_threshold   = 3
          + interval            = 10
          + matcher             = "200"
          + path                = "/"
          + port                = "traffic-port"
          + protocol            = "HTTP"
          + timeout             = 3
          + unhealthy_threshold = 2
        }
    }

  # aws_lb_target_group_attachment.attach-app1[0] will be created
  + resource "aws_lb_target_group_attachment" "attach-app1" {
      + id               = (known after apply)
      + port             = 80
      + target_group_arn = (known after apply)
      + target_id        = (known after apply)
    }

  # aws_lb_target_group_attachment.attach-app1[1] will be created
  + resource "aws_lb_target_group_attachment" "attach-app1" {
      + id               = (known after apply)
      + port             = 80
      + target_group_arn = (known after apply)
      + target_id        = (known after apply)
    }

  # aws_lb_target_group_attachment.attach-app1[2] will be created
  + resource "aws_lb_target_group_attachment" "attach-app1" {
      + id               = (known after apply)
      + port             = 80
      + target_group_arn = (known after apply)
      + target_id        = (known after apply)
    }

  # aws_route.private-route[0] will be updated in-place
  ~ resource "aws_route" "private-route" {
      + gateway_id             = "nat-071372bf2d3bd0659"
        id                     = "r-rtb-0b47c8ab842de20301080289494"
      - nat_gateway_id         = "nat-071372bf2d3bd0659" -> null
        # (4 unchanged attributes hidden)
    }

  # aws_route.private-route[1] will be updated in-place
  ~ resource "aws_route" "private-route" {
      + gateway_id             = "nat-0f12f13854256e79d"
        id                     = "r-rtb-01ab94e509c91d7a71080289494"
      - nat_gateway_id         = "nat-0f12f13854256e79d" -> null
        # (4 unchanged attributes hidden)
    }

  # aws_route.private-route[2] will be updated in-place
  ~ resource "aws_route" "private-route" {
      + gateway_id             = "nat-059563097a1d7eaf1"
        id                     = "r-rtb-0f01b494bd773f4721080289494"
      - nat_gateway_id         = "nat-059563097a1d7eaf1" -> null
        # (4 unchanged attributes hidden)
    }

  # aws_security_group.ec2_instance will be created
  + resource "aws_security_group" "ec2_instance" {
      + arn                    = (known after apply)
      + description            = "Allow inbound and outbound traffic to EC2 instances from load balancer security group"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = []
              + description      = ""
              + from_port        = 80
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = (known after apply)
              + self             = false
              + to_port          = 80
            },
        ]
      + name                   = "IN-SG"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags_all               = {
          + "Source" = "https://github.com/kunduso/add-aws-elb-ec2-private-subnet-terraform"
        }
      + vpc_id                 = "vpc-0d128a4188199ed21"
    }

  # aws_security_group.lb will be created
  + resource "aws_security_group" "lb" {
      + arn                    = (known after apply)
      + description            = "Allow inbound and outbound traffic to load balancer from the internet."
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 80
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 80
            },
        ]
      + name                   = "LB-SG"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags_all               = {
          + "Source" = "https://github.com/kunduso/add-aws-elb-ec2-private-subnet-terraform"
        }
      + vpc_id                 = "vpc-0d128a4188199ed21"
    }

Plan: 11 to add, 3 to change, 0 to destroy.

Changes to Outputs:
  + load_balancer_dns_name = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: TFplan.JSON

To perform exactly these actions, run the following command to apply:
    terraform apply "TFplan.JSON"

```

</details>

*Pushed by: @kunduso, Action: `pull_request`*